<?php

/* 
 * 定数クラスです。
 * 
 */
return[
    // 年度
    'YEAR_LIST' => array(
        '' => '---',
/*
        2023 => '2023',
        2022 => '2022',
        2021 => '2021',
        2020 => '2020'
*/

        2024 => '2024',
        2023 => '2023',
        2022 => '2022',
        2021 => '2021'
    ),
    
    // 学年
    'GRADE_LIST' => array(
        '' => '---',
        '1' => '高1',
        '2' => '高2',
        '3' => '高3'
    ),

    // 大学検索用の学年
    'UNVS_GRADE_LIST' => array(
        '' => '---',
        '1' => '1年',
        '2' => '2年',
        '3' => '3年',
        '9' => '既卒',
    ),

    // 設置区分
    'INST_CLASS_LIST' => array(
        '' => '---',

        '1' => '国立大学',
        '2' => '公立大学',
        '3' => '私立大学',
        '4' => '大学校',
        '5' => '専門職大学',
        '6' => '公立短期大学',
        '7' => '私立短期大学',
        '8' => '専門職短期大学'
    ),

    // 塾
    'SCHOOL_LIST' => array(
        '' => '---',
        '1' => '全国共通（一般塾用）',
        '2' => 'OEM塾A',
        '3' => 'OEM塾B'
    ),

    
    // コードデータ
    'CODE_DATA' => [
        'UNIV_CODE' => [
            'NAME' => '大学コードデータ',
            'VALUE' => 1,
        ],
        'HIGH_SCHOOL_CODE' => [
            'NAME' => '高校コードデータ',
            'VALUE' => 2,
        ],
    ],

    // 学部/学科判定
    'DEPT_SUBJ_SELECT' => [
        'DEPT' => [
            'NAME' => '学部判定',
            'VALUE' => 1,
        ],
        'SUBJ' => [
            'NAME' => '学科判定',
            'VALUE' => 2,
        ],
    ],

    // 高校コード検索その他のプルダウン
    'HIGH_SCHOOL_CODE_SELECT' => [
        'OPTIONS' => [
            '51000K' => '高校卒業程度認定試験・大学入学資格検定',
            '52000E' => '外国の学校等',
            '53000A' => '文部科学大臣の指定した者',
            '54000F' => '認定',
            '55000A' => '在外教育施設',
            '56000G' => '専修学校の高等課程',
            '47999D' => '上記以外の高等学校等',
            '51000K' => '高校卒業程度認定試験・大学入学資格検定',
            '52000E' => '外国の学校等',
            '53000A' => '文部科学大臣の指定した者',
            '54000F' => '認定',
            '55000A' => '在外教育施設',
            '56000G' => '専修学校の高等課程'
        ]
    ],

    // 大学コード検索画面用偏差値プルダウン
    'UNIV_CODE_DEVIATION' => [
        'VALUES' => function() {  // config('selectlistarray.UNIV_CODE_DEVIATION.VALUES')()で使う
            $min = 30;
            $max = 80;
            $step = 0.5;
            $values = [];
            for ($i = $min; $i <= $max; $i += $step) {
                $values[] = number_format($i, 1);
            }
            return $values;
        },
    ],
];

