<?php

/* 
 * 定数クラスです。
 * 
 */
return[
    // 年度
    'YEAR_LIST' => array(
        '' => '---',
/*
        2023 => '2023',
        2022 => '2022',
        2021 => '2021',
        2020 => '2020'
*/

        2024 => '2024',
        2023 => '2023',
        2022 => '2022',
        2021 => '2021'
    ),
    
    // 学年
    'GRADE_LIST' => array(
        '' => '---',
        '1' => '高1',
        '2' => '高2',
        '3' => '高3'
    ),

    // 大学検索用の学年
    'UNVS_GRADE_LIST' => array(
        '' => '---',
        '1' => '1年',
        '2' => '2年',
        '3' => '3年',
        '9' => '既卒',
    ),

    // 設置区分
    'INST_CLASS_LIST' => array(
        '' => '---',

        '1' => '国立大学',
        '2' => '公立大学',
        '3' => '私立大学',
        '4' => '大学校',
        '5' => '専門職大学',
        '6' => '公立短期大学',
        '7' => '私立短期大学',
        '8' => '専門職短期大学'
    ),

    // 塾
    'SCHOOL_LIST' => array(
        '' => '---',
        '1' => '全国共通（一般塾用）',
        '2' => 'OEM塾A',
        '3' => 'OEM塾B'
    ),

    
    // コードデータ
    'CODE_DATA' => [
        'UNIV_CODE' => [
            'NAME' => '大学コードデータ',
            'VALUE' => 1,
        ],
        'HIGH_SCHOOL_CODE' => [
            'NAME' => '高校コードデータ',
            'VALUE' => 2,
        ],
    ],

    // 学部/学科判定
    'DEPT_SUBJ_SELECT' => [
        'DEPT' => [
            'NAME' => '学部判定',
            'VALUE' => 1,
        ],
        'SUBJ' => [
            'NAME' => '学科判定',
            'VALUE' => 2,
        ],
    ]
];

